/*6.10. Саставити програм који ће прво да учита број m. Тај број мора бити већи од 0 и мањи од 10.
Ако тај услов није испуњен учитавање поновити. Програм треба даље да учитава низ бројева, а унос
се завршава са нулом. Програм треба наћи и исписати број n који показује колико међу учитаним
бројевима има оних код којих је прва цифра m.
*/
#include <stdio.h>
int main(){
    int m, a, x, n, t;
    n=0;
    do{
        printf("Unesite broj m: ");
        scanf("%d",&m);
    }
    while(m<=0 || m>=10);
    do{
        scanf("%d", &a); // 845 // 8
        //zadanja cifra:
        t=a;
        while(t > 0) {
            x = t % 10;
            t /= 10;
        }
        if(x==m){
            n++;
        }
    }
    while(a!=0);
    printf("postoji %d unetih brojeva kod kojih  je prva cifra %d ", n, m);
    return 0;
}