/*1.17. Саставити функцију која:
a) израчунава дужину стринга;
б) копира стринг ѕ2 у стринг ѕ1, претпоставља да у ѕ1 има довољно простора;
в) надовезује стринг ѕ2 на крај стринга ѕ1, претпоставља да у ѕ1 има довољно простора
г) врши лексикографско поређење два стринга, враћа: 0 - уколико су стрингови једнаки, <0 -
уколико је ѕ1 лексикографски испред ѕ2, >0 - уколико је ѕ1 лексикографски иза ѕ2;
д) проналази прву позицију карактера с у стрингу ѕ, враћа позицију на којој је с, односно -1 уколико
ѕ не садржи с; 
ђ) проналази последњу позицију карактера с у стрингу ѕ, враћа позицију на којој је с, односно -1
уколико ѕ не садрзи с;
е) проверава да ли стринг ѕ1 садржи стринг ѕ2, враћа позицију на којој ѕ2 почиње, односно -1
уколико га нема.
f)Тестирати формиране функције у главном програму. 
*/
#include <stdio.h>
#include <string.h>
#include <ctype.h>
#include <stdlib.h>
#define MAX 100
//a) израчунава дужину стринга;
int duzina(char s[]){
    printf("%s", s);
    int i;
    for (i=0; s[i]; i++);
    return i;
}
void kopiranje(char s1[], char s2[]){
    strcpy(s2, s1);
}

int main(){
    char s1[MAX] = "Nikola";
    char s2[MAX] = "Matković";
    printf("%d", (int) duzina(s1));
    kopiranje(s1, s2);
    printf("%s", s2);
    return 0;
}