/*10.41. Саставити програм за сортирање унетог низа целих бројева дужине n у неопадајући поредак
методом мехурића (Bubble Sort). Исписати сортирани низ.
Bubble Sort: Пролазимо кроз низ редом поредећи суседне елементе, и при том их замењујући
ако су у погрешном поретку. Овим се највећи елемент попут мехурића истискује на "површину", тј.
на крајњу десну позицију. Након тога је потребно овај поступак поновити над низом а[0],...,а[n-2], тј.
над првих n-1 елемената низа без последњег који је постављен на праву позицију. Након тога се исти
поступак понавља над све краћим и краћим префиксима низа, чиме се један по један истискују
елемененти на своје праве позиције. */

#include<stdio.h>
int main(){
    int i,n,j;
    printf("Unesite n:");
    scanf("%d",&n);
    int niz[n];
    printf("Unseite niz:");
    for(i=0;i<n;i++){
        scanf("%d",&niz[i]);
    }
    for(i=0;i<n;i++){
        for(j=i+1;j<n;j++){
            if(niz[i]>niz[j]){
                niz[i]=niz[i]^niz[j];
                niz[j]=niz[i]^niz[j];
                niz[i]=niz[i]^niz[j];
            }
        }
    }
    for(i=0;i<n;i++){
        printf("%d",niz[i]);
    }
    return 0;
}