// 3.13. Саставити програм који алоцира низ од max=5 целобројних елемената. Корисник затим
// уноси низ бројева. Ако број унетих бројева премаши max, тада се повећава алоцирана меморија за
// додатних 5 елемената. Унос се прекида када корисник укуца слово. На крају се исписује низ и
// деалоцира меморија.

#include<stdio.h>
#include<stdlib.h>



int main(){
    int *niz,maks = 5;
    int br;
    int broj;
    niz = (int*)malloc(maks*sizeof(int));
    while(scanf("%d",&broj) == 1){
        niz[++br] = broj;
    }
 

    return 0;
}