/*9.17. Саставити програм којим се исписују сви троцифрени Амстронгови бројеви. Троцифрени
број је Амстронгов ако је једнак суми кубова својих цифара. Формирати две функције, једна за
рачунање суме кубова, а друга за одређивање да ли је дати број Амстронгов (ако јесте враћа 1, ако
није враћа 0). */

#include<stdio.h>
#include<math.h>

int suma_kubova(int s){
    int i;
    for(i=0;i<=9;i++){
        for(i=0;i<=9;i++){
            for(i=0;i<=9;i++){

            }
        }
    }
    s+=pow(i,3);
    return s;
}
int amstrong(int a){
    while(a>100 && a<1000){
        if(a==suma_kubova(a)){
            return 1;
        }
        else return 0;
    }

}
int main(){
    int a;
    
}
