// 1.25. Саставити програм који учитава стринг, који представља реченицу, и који проверава да ли је
// реченица исправно унета. Исправно унета реченица задовољава следеће услове:
// - реченица мора почети великим словом и завршити се тачком;
// - речи су произвољни подстрингови који могу садржати само мала слова.
// - речи могу бити раздвојени једним размаком (SPACE), зарезом или тачка-зарезом.
// На излазу исписати обавештење да ли је реченица исправно унета. 

#include<stdio.h>
#include<string.h>

#define SIZE 100

int main(){
    char recenica[SIZE];
    int i;
    int n;
    printf("Unsite recenicu:\n");
    scanf("%s",recenica);
    n = strlen(recenica);
        
    return 0;
}