// 4.26. Структура radnik садржи податке о имену, презимену, броју радних сати и плати радника.
// Саставити програм за повећање плате n радника према проведеном радном времену на послу. Месец
// има 160 радних сати. За прековремени рад од 20 сати месечно повишица је 15%, за прековремени рад
// од 30 сати је 25%. Исписати списак радника са свим подацима који добијају повишицу. 

#include<stdio.h>
#include<string.h>

#define SIZE 100

typedef struct radnik{
    char ime[30];
    char prezime[30];
    int brojRadnihSati;
    int plata;
}RADNIK;

int main(){
     struct radnik radnici;

    return 0;
}